Repository: schleicher-dev/Sammlung
Catalog: Sammlung.Werkzeug/Resources/ErrorMessages.*.resx
Languages: de_de

# ParamRequireAtLeastNumElements
source: The parameter is expected to have at least {0} elements, but actually there were {1}.
de_de: Es wurde erwartet, dass der Parameter mindestens {0} Elemente beinhaltet. Jedoch wurden {1} Elemente gefunden.

# ParamRequireAtMostNumElements
source: The parameter is expected to have at most {0} elements, but actually there were {1}.
de_de: Es wurde erwartet, dass der Parameter höchstens {0} Elemente beinhaltet. Jedoch wurden {1} Elemente gefunden.

# ParamRequireExactlyNumElements
source: The parameter is expected to have exactly {0} elements, but actually there were {1}.
de_de: Es wurde erwartet, dass der Parameter exakt {0} Elemente beinhaltet. Jedoch wurden {1} Elemente gefunden.

# ParamRequiredEqual
source: The parameter is expected to be equal to {0}.
de_de: Es wurde erwartet, dass der Parameter mit {0} übereinstimmt.

# ParamRequiredGreater
source: The parameter is expected to be greater than {0}.
de_de: Es wurde erwartet, dass der Parameter größer als {0} ist.

# ParamRequiredGreaterEqual
source: The parameter is expected to be greater than or equal to {0}.
de_de: Es wurde erwartet, dass der Parameter größer oder gleich wie {0} ist.

# ParamRequiredLessEqual
source: The parameter is expected to be less than or equal to {0}.
de_de: Es wurde erwartet, dass der Parameter kleiner oder gleich wie {0} ist.

# ParamRequiredLess
source: The parameter is expected to be less than {0}.
de_de: Es wurde erwartet, dass der Parameter kleiner als {0} ist.

# ParamRequiredNotNull
source: The parameter is expected to be not null.
de_de: Es wurde erwartet, dass der Parameter nicht NULL ist.

# ParamStringRequiredNotNullOrEmpty
source: The string parameter is expected to be not null or empty.
de_de: Es wurde erwartet, dass der String-Parameter nicht NULL oder leer ist.
